app/controllers/backoffice/admins_controller.rb

INSERT INTO "admins" ("name", "email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		@admin = Admin.new(params_admin)
		if @admin.save

UPDATE "admins" SET "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["encrypted_password", "$2a$11$mDWWEizDiDZMe6kH8z7TXu0nCBEcdupOd/LJmX9/.5NgDE9tYvjr."], ["updated_at", "2017-07-27 19:58:47.233823"], ["id", 2]]
---
	def update
		if @admin.update(params_admin)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 1]]
---
	def destroy
		authorize @admin
		admin_name = @admin.name

		if @admin.destroy

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ?  ORDER BY "admins"."id" ASC LIMIT 1  [["id", 1]]
---
		def set_admin
			@admin = Admin.find(params[:id])