app/controllers/backoffice/categories_controller.rb

	def create
		@category = CategoryService.create(params_category)
---
INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Perfume"], ["created_at", "2017-07-27 16:48:05.051613"], ["updated_at", "2017-07-27 16:48:05.051613"]]

	def update
		if @category.update(params_category)
---
UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "Carros"], ["updated_at", "2017-07-27 17:16:08.702963"], ["id", 12]]