app/controllers/backoffice/send_mail_controller.rb

	def edit

		@admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 2]]